wrickert/UntitledElectronics/Badges/BsidesDSM26/Code/ch585_grand_finale/ch585_grand_finale.c
static inline uint64_t now_ticks(void) {
	return (uint64_t)funSysTick32();
}

typedef struct {
	uint16_t duration_ms;
	uint16_t hz;
} audio_note_t;

static const audio_note_t g_tag_cue[] = {
	{ 160u, NOTE_C5 },
	{ 40u,  0u      },
	{ 160u, NOTE_E5 },
	{ 40u,  0u      },
	{ 160u, NOTE_G5 },
	{ 40u,  0u      },
	{ 240u, NOTE_A5 },
};

static const uint16_t g_uid_scale[] = {
	262u, // C4
	294u, // D4
	330u, // E4
	392u, // G4
	440u, // A4
	523u, // C5
	659u, // E5
	784u, // G5
};

typedef enum {
	NFCA_PCD_CONTROLLER_STATE_FREE = 0,
	NFCA_PCD_CONTROLLER_STATE_SENDING,
	NFCA_PCD_CONTROLLER_STATE_RECEIVING,
	NFCA_PCD_CONTROLLER_STATE_COLLISION,
	NFCA_PCD_CONTROLLER_STATE_OVERTIME,
	NFCA_PCD_CONTROLLER_STATE_DONE,
	NFCA_PCD_CONTROLLER_STATE_ERR,
} nfca_pcd_controller_state_t;

typedef enum {
	NFCA_PCD_DRV_CTRL_LEVEL0 = (0x00 << 13),
	NFCA_PCD_DRV_CTRL_LEVEL1 = (0x01 << 13),
	NFCA_PCD_DRV_CTRL_LEVEL2 = (0x02 << 13),
	NFCA_PCD_DRV_CTRL_LEVEL3 = (0x03 << 13),
} NFCA_PCD_DRV_CTRL_Def;

typedef enum {
	NFCA_PCD_REC_MODE_NONE   = 0,
	NFCA_PCD_REC_MODE_NORMAL = 1,
	NFCA_PCD_REC_MODE_COLI   = 0x10,
} NFCA_PCD_REC_MODE_Def;

#if SK6812_PROFILE == 1
	#ifndef SK6812_T0H_NOPS
	#define SK6812_T0H_NOPS 2
	#endif
	#ifndef SK6812_T0L_NOPS
	#define SK6812_T0L_NOPS 24
	#endif
	#ifndef SK6812_T1H_NOPS
	#define SK6812_T1H_NOPS 6
	#endif
	#ifndef SK6812_T1L_NOPS
	#define SK6812_T1L_NOPS 14
	#endif
#elif SK6812_PROFILE == 3
	#ifndef SK6812_T0H_NOPS
	#define SK6812_T0H_NOPS 4
	#endif
	#ifndef SK6812_T0L_NOPS
	#define SK6812_T0L_NOPS 22
	#endif
	#ifndef SK6812_T1H_NOPS
	#define SK6812_T1H_NOPS 10
	#endif
	#ifndef SK6812_T1L_NOPS
	#define SK6812_T1L_NOPS 12
	#endif
#elif SK6812_PROFILE == 4
	#ifndef SK6812_T0H_NOPS
	#define SK6812_T0H_NOPS 30
	#endif
	#ifndef SK6812_T0L_NOPS
	#define SK6812_T0L_NOPS 80
	#endif
	#ifndef SK6812_T1H_NOPS
	#define SK6812_T1H_NOPS 70
	#endif
	#ifndef SK6812_T1L_NOPS
	#define SK6812_T1L_NOPS 40
	#endif
#elif SK6812_PROFILE == 5
	#ifndef SK6812_T0H_NOPS
	#define SK6812_T0H_NOPS 0
	#endif
	#ifndef SK6812_T0L_NOPS
	#define SK6812_T0L_NOPS 40
	#endif
	#ifndef SK6812_T1H_NOPS
	#define SK6812_T1H_NOPS 12
	#endif
	#ifndef SK6812_T1L_NOPS
	#define SK6812_T1L_NOPS 28
	#endif
#elif SK6812_PROFILE == 2
	#ifndef SK6812_T0H_NOPS
	#define SK6812_T0H_NOPS 8
	#endif
	#ifndef SK6812_T0L_NOPS
	#define SK6812_T0L_NOPS 18
	#endif
	#ifndef SK6812_T1H_NOPS
	#define SK6812_T1H_NOPS 22
	#endif
	#ifndef SK6812_T1L_NOPS
	#define SK6812_T1L_NOPS 10
	#endif
#else
	#ifndef SK6812_T0H_NOPS
	#define SK6812_T0H_NOPS 6
	#endif
	#ifndef SK6812_T0L_NOPS
	#define SK6812_T0L_NOPS 20
	#endif
	#ifndef SK6812_T1H_NOPS
	#define SK6812_T1H_NOPS 16
	#endif
	#ifndef SK6812_T1L_NOPS
	#define SK6812_T1L_NOPS 10
	#endif
#endif

#define SK6812__ADD_N_NOPS(n) asm volatile( ".rept " #n "\nc.nop\n.endr" );
#define SK6812_ADD_N_NOPS(n)  SK6812__ADD_N_NOPS(n)

void nfca_pcd_wait_ms(uint32_t milliseconds);
uint8_t nfca_pcd_comm(uint16_t data_bits_num, NFCA_PCD_REC_MODE_Def mode, uint8_t offset);
nfca_pcd_controller_state_t nfca_pcd_wait_comm_end(void);
uint16_t ISO14443_CRCA(uint8_t *buf, int len);
uint16_t ISO14443AAppendCRCA(void *buf, uint16_t len);
uint8_t ISO14443ACheckOddParityBit(uint8_t *data, uint8_t *parity, uint16_t len);
void ISO14443ACalOddParityBit(uint8_t *data, uint8_t *out_parity, uint16_t len);

static void __attribute__((noinline)) sk6812_send_bit_0(void)
{
	GPIO_SetBits(STATUS_SK6812_PIN);
	SK6812_ADD_N_NOPS(SK6812_T0H_NOPS);
	GPIO_ResetBits(STATUS_SK6812_PIN);
	SK6812_ADD_N_NOPS(SK6812_T0L_NOPS);
}

static void __attribute__((noinline)) sk6812_send_bit_1(void)
{
	GPIO_SetBits(STATUS_SK6812_PIN);
	SK6812_ADD_N_NOPS(SK6812_T1H_NOPS);
	GPIO_ResetBits(STATUS_SK6812_PIN);
	SK6812_ADD_N_NOPS(SK6812_T1L_NOPS);
}

static void sk6812_send_byte(uint8_t b)
{
	for (int i = 0; i < 8; i++)
	{
#if SK6812_LSB_FIRST
		if (b & 0x01) sk6812_send_bit_1();
		else          sk6812_send_bit_0();
		b >>= 1;
#else
		if (b & 0x80) sk6812_send_bit_1();
		else          sk6812_send_bit_0();
		b <<= 1;
#endif
	}
}

static void sk6812_set_grbw(uint8_t g, uint8_t r, uint8_t b, uint8_t w)
{
#if !SK6812_DISABLE
	uint8_t irq_was_enabled = __isenabled_irq();
	__disable_irq();
	sk6812_send_byte(g);
	sk6812_send_byte(r);
	sk6812_send_byte(b);
#if SK6812_IS_RGBW
	sk6812_send_byte(w);
#else
	(void)w;
#endif
	if (irq_was_enabled) __enable_irq();
#else
	(void)g;
	(void)r;
	(void)b;
	(void)w;
#endif

	GPIO_ResetBits(STATUS_SK6812_PIN);
	Delay_Ms(1);
}

static void sk6812_set_rgb(uint8_t r, uint8_t g, uint8_t b)
{
	sk6812_set_grbw(g, r, b, SK6812_W_BRIGHT);
}

static void audio_init(void)
{
	funPinMode(AUDIO_OUTPUT_PIN, GPIO_ModeOut_PP_20mA);
	GPIO_ResetBits(AUDIO_OUTPUT_PIN);
}

static void play_tone(uint16_t hz, uint16_t duration_ms)
{
	if (!hz)
	{
		GPIO_ResetBits(AUDIO_OUTPUT_PIN);
		Delay_Ms(duration_ms);
		return;
	}

	uint16_t half_period_us = (uint16_t)(500000u / hz);
	uint32_t cycles = ((uint32_t)hz * duration_ms) / 1000u;

	if (!half_period_us) half_period_us = 1;
	if (!cycles) cycles = 1;

	for (uint32_t i = 0; i < cycles; i++)
	{
		GPIO_SetBits(AUDIO_OUTPUT_PIN);
		Delay_Us(half_period_us);
		GPIO_ResetBits(AUDIO_OUTPUT_PIN);
		Delay_Us(half_period_us);
	}
}

static void audio_play_tag_cue(const uint8_t *uid, uint8_t uid_len)
{
	audio_init();

	if (!uid_len)
	{
		for (unsigned note_idx = 0; note_idx < (sizeof(g_tag_cue) / sizeof(g_tag_cue[0])); note_idx++)
		{
			play_tone(g_tag_cue[note_idx].hz, g_tag_cue[note_idx].duration_ms);
		}
		return;
	}

	uint8_t note_count = uid_len;
	if (note_count > 8u) note_count = 8u;

	for (uint8_t i = 0; i < note_count; i++)
	{
		uint8_t b = uid[i];
		uint16_t hz = g_uid_scale[b & 0x07u];
		uint16_t duration_ms = 90u + ((uint16_t)((b >> 3) & 0x03u) * 30u);

		play_tone(hz, duration_ms);
		play_tone(0u, 24u);
	}
}

static void audio_play_detect_chirp(void)
{
	audio_init();
	play_tone(988u, 28u);
	play_tone(0u, 20u);
	play_tone(1319u, 36u);
}

static void audio_play_boot_debug_beep(void)
{
	audio_init();

	for (unsigned burst = 0; burst < 2; burst++)
	{
		play_tone(burst ? 784u : 523u, 120u);
		Delay_Ms(30);
	}
}

static void tag_feedback(uint8_t uid_len, uint16_t atqa, uint8_t sak)
{
	uint8_t r = (uid_len ? ((gs_picc_uid[0] * 5u) & 0x1Fu) : 8u) + 4u;
	uint8_t g = ((uint8_t)(atqa) & 0x1Fu) + 4u;
	uint8_t b = (sak & 0x1Fu) + 4u;

	if (r > SK6812_BRIGHT) r = SK6812_BRIGHT;
	if (g > SK6812_BRIGHT) g = SK6812_BRIGHT;
	if (b > SK6812_BRIGHT) b = SK6812_BRIGHT;

	sk6812_set_rgb(r, g, b);
	audio_play_tag_cue(gs_picc_uid, uid_len);
	sk6812_set_rgb(0, 0, 0);
}

static inline void nfca_rx_finalize_from_hw(void) {
	g_nfca_pcd_recv_bits = R16_NFC_RXTX_LEN;
	uint16_t received_words = (g_nfca_pcd_recv_bits + 15) / 16;
	if (g_nfca_pcd_recv_word_idx < received_words) {
		uint16_t words_to_drain = received_words - g_nfca_pcd_recv_word_idx;
		for (int i = 0; i < words_to_drain; i++) {
			gs_nfca_data_buf[g_nfca_pcd_recv_word_idx++] = R16_NFC_FIFO;
		}
	}
}

static inline void usb_rx_reset_assembly(void) {
	g_usb_rx_expected = 0;
	g_usb_rx_received = 0;
	g_usb_rx_len_bytes = 0;
	g_usb_rx_len_tmp0 = 0;
	g_usb_rx_len_tmp1 = 0;
}

static inline int usb_tx_queue_message(const uint8_t *payload, uint16_t payload_len) {
	if (payload_len > USB_APP_MAX_PAYLOAD) return -1;
	if (g_usb_tx_len) return -2; // busy

	g_usb_tx_buf[0] = (uint8_t)(payload_len & 0xff);
	g_usb_tx_buf[1] = (uint8_t)(payload_len >> 8);
	if (payload_len) memcpy(&g_usb_tx_buf[2], payload, payload_len);
	g_usb_tx_off = 0;
	g_usb_tx_len = payload_len + 2;
	return 0;
}

static inline void usb_tx_pump(void) {
	// USBFS uses "prime then host IN" semantics; we must explicitly ACK a packet with USBFS_SendEndpointNEW.
	if (!g_usb_tx_len) return;
	if (USBFSCTX.USBFS_Endp_Busy[USB_EP_TX] & 1) return;

	// Stage 0: send 2-byte header as a short packet.
	if (g_usb_tx_off == 0 && g_usb_tx_len >= 2) {
		USBFS_SendEndpointNEW(USB_EP_TX, (uint8_t*)g_usb_tx_buf, 2, /*copy=*/1);
		g_usb_tx_off = 2;
		if (g_usb_tx_len == 2) {
			g_usb_tx_len = 0;
			g_usb_tx_off = 0;
		}
		return;
	}

	// Stage 1: send payload in 64-byte packets.
	uint16_t remaining = g_usb_tx_len - g_usb_tx_off;
	uint16_t chunk = remaining > USBFS_MAX_PACKET ? USBFS_MAX_PACKET : remaining;
	USBFS_SendEndpointNEW(USB_EP_TX, (uint8_t*)&g_usb_tx_buf[g_usb_tx_off], chunk, /*copy=*/1);
	g_usb_tx_off += chunk;
	if (g_usb_tx_off >= g_usb_tx_len) {
		g_usb_tx_len = 0;
		g_usb_tx_off = 0;
	}
}

static void usb_send_ntag_version_packet(int uid_len)
{
	uint8_t packet[1 + 1 + 1 + 10 + NTAG21X_VERSION_LEN];

