wrickert/UntitledElectronics/Badges/BsidesDSM26/Code/ch585_grand_finale/ch585_grand_finale.c
	packet[0] = USB_PKT_NTAG_VERSION;
	packet[1] = (uint8_t)uid_len;
	for (int i = 0; i < uid_len; ++i) {
		packet[2 + i] = gs_picc_uid[i];
	}
	for (int i = uid_len; i < 10; ++i) {
		packet[2 + i] = 0;
	}
	for (int i = 0; i < NTAG21X_VERSION_LEN; ++i) {
		packet[12 + i] = g_last_ntag_version[i];
	}

	while (g_usb_tx_len) { }
	usb_tx_queue_message(packet, sizeof(packet));
	usb_tx_pump();
}

static void usb_send_ntag_page_packet(uint8_t start_page, const uint8_t *page_data, uint8_t page_count)
{
	uint8_t packet[2 + NTAG_T2T_READ_BYTES];

	packet[0] = USB_PKT_NTAG_PAGE_DATA;
	packet[1] = start_page;
	memcpy(&packet[2], page_data, NTAG_T2T_READ_BYTES);

	while (g_usb_tx_len) { }
	usb_tx_queue_message(packet, (uint16_t)(2 + (page_count * 4)));
	usb_tx_pump();
}

static void usb_send_ntag_done_packet(uint8_t status_code)
{
	uint8_t packet[2] = { USB_PKT_NTAG_DONE, status_code };

	while (g_usb_tx_len) { }
	usb_tx_queue_message(packet, sizeof(packet));
	usb_tx_pump();
}

static int ntag_get_version(void)
{
	g_nfca_pcd_send_buf[0] = CMD_T2T_GET_VERSION;
	ISO14443AAppendCRCA(g_nfca_pcd_send_buf, 1);
	ISO14443ACalOddParityBit(g_nfca_pcd_send_buf, g_nfca_parity_buf, 3);
	nfca_pcd_wait_ms(PCD_T2T_OVER_TIME);

	if (nfca_pcd_comm(24, NFCA_PCD_REC_MODE_NORMAL, 0) != 0) {
		return 0;
	}
	if (nfca_pcd_wait_comm_end() != NFCA_PCD_CONTROLLER_STATE_DONE) {
		return 0;
	}
	if ((g_nfca_pcd_recv_bits % 9) != 0) {
		return 0;
	}

	int nbytes = g_nfca_pcd_recv_bits / 9;
	if (nbytes != (NTAG21X_VERSION_LEN + 2)) {
		return 0;
	}
	if (!ISO14443ACheckOddParityBit(g_nfca_pcd_recv_buf, g_nfca_parity_buf, nbytes)) {
		return 0;
	}
	if (ISO14443_CRCA(g_nfca_pcd_recv_buf, nbytes) != 0) {
		return 0;
	}

	for (int i = 0; i < NTAG21X_VERSION_LEN; ++i) {
		g_last_ntag_version[i] = g_nfca_pcd_recv_buf[i];
	}

	return 1;
}

static int ntag_is_ntag215(void)
{
	return (g_last_ntag_version[1] == 0x04) &&
	       (g_last_ntag_version[2] == 0x04) &&
	       (g_last_ntag_version[3] == 0x02) &&
	       (g_last_ntag_version[6] == 0x11);
}

static int ntag_read_pages(uint8_t start_page)
{
	g_nfca_pcd_send_buf[0] = CMD_T2T_READ;
	g_nfca_pcd_send_buf[1] = start_page;
	ISO14443AAppendCRCA(g_nfca_pcd_send_buf, 2);
	ISO14443ACalOddParityBit(g_nfca_pcd_send_buf, g_nfca_parity_buf, 4);
	nfca_pcd_wait_ms(PCD_T2T_OVER_TIME);

	if (nfca_pcd_comm(32, NFCA_PCD_REC_MODE_NORMAL, 0) != 0) {
		return 0;
	}
	if (nfca_pcd_wait_comm_end() != NFCA_PCD_CONTROLLER_STATE_DONE) {
		return 0;
	}
	if ((g_nfca_pcd_recv_bits % 9) != 0) {
		return 0;
	}

	int nbytes = g_nfca_pcd_recv_bits / 9;
	if (nbytes != (NTAG_T2T_READ_BYTES + 2)) {
		return 0;
	}
	if (!ISO14443ACheckOddParityBit(g_nfca_pcd_recv_buf, g_nfca_parity_buf, nbytes)) {
		return 0;
	}

	return ISO14443_CRCA(g_nfca_pcd_recv_buf, nbytes) == 0;
}

static void ntag_dump_read_only(int uid_len)
{
	uint8_t page_starts[(NTAG215_TOTAL_PAGES + 3) / 4];
	int page_start_count = 0;

	for (uint8_t page = 0; page <= 128; page += 4) {
		page_starts[page_start_count++] = page;
	}
	page_starts[page_start_count++] = 131;

	if (!ntag_get_version()) {
		usb_send_ntag_done_packet(1);
		return;
	}

	if (!ntag_is_ntag215()) {
		usb_send_ntag_done_packet(2);
		return;
	}

	usb_send_ntag_version_packet(uid_len);

	for (int i = 0; i < page_start_count; ++i) {
		uint8_t start_page = page_starts[i];
		uint8_t valid_pages = 4;

		if ((start_page + 4) > NTAG215_TOTAL_PAGES) {
			valid_pages = NTAG215_TOTAL_PAGES - start_page;
		}

		if (!ntag_read_pages(start_page)) {
			usb_send_ntag_done_packet(3);
			return;
		}

		usb_send_ntag_page_packet(start_page, g_nfca_pcd_recv_buf, valid_pages);
	}

	usb_send_ntag_done_packet(0);
}

typedef enum {
	SampleFreq_8 = 0,
	SampleFreq_8_or_4,
	SampleFreq_5_33_or_2_67,
	SampleFreq_4_or_2,
} ADC_SampClkTypeDef;

typedef enum {
	ADC_PGA_1_4 = 0,
	ADC_PGA_1_2,
	ADC_PGA_0,
	ADC_PGA_2,
	ADC_PGA_2_ = 0x10,
	ADC_PGA_4,
	ADC_PGA_8,
	ADC_PGA_16,
} ADC_SignalPGATypeDef;

typedef enum {
	CH_EXTIN_0 = 0,
	CH_EXTIN_1,
	CH_EXTIN_2,
	CH_EXTIN_3,
	CH_EXTIN_4,
	CH_EXTIN_5,
	CH_EXTIN_6,
	CH_EXTIN_7,
	CH_EXTIN_8,
	CH_EXTIN_9,
	CH_EXTIN_10,
	CH_EXTIN_11,
	CH_EXTIN_12,
	CH_EXTIN_13,

	CH_INTE_VBAT = 14,
	CH_INTE_VTEMP = 15,
	CH_INTE_NFC = 16,
} ADC_SingleChannelTypeDef;

enum {
	PCD_NO_ERROR              = 0,
	PCD_COMMUNICATE_ERROR     = 1,
	PCD_ODD_PARITY_ERROR      = 2,
	PCD_UNKNOWN_ERROR         = 3,

	PCD_OVERTIME_ERROR        = 0x0100,
	PCD_FRAME_ERROR           = 0x0101,
	PCD_BCC_ERROR             = 0x0102,
	PCD_CRC_ERROR             = 0x0103,
	PCD_AUTH_ERROR            = 0x0104,
	PCD_DECRYPT_ERROR         = 0x0105,
	PCD_VALUE_BLOCK_INVALID   = 0x0106,
};

typedef enum {
	High_Level = 0,
	Low_Level,
} PWMX_PolarTypeDef;

typedef enum {
	PWM_Times_1 = 0,
	PWM_Times_4,
	PWM_Times_8,
	PWM_Times_16,
} PWM_RepeatTsTypeDef;

typedef enum {
	CAP_NULL = 0,
	Edge_To_Edge,
	FallEdge_To_FallEdge,
	RiseEdge_To_RiseEdge,
} CapModeTypeDef;

static const uint8_t byteParityBitsTable[256] = {
	1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1,
	0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0,
	0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0,
	1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1,
	0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0,
	1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1,
	1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1,
	0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0,
	0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0,
	1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1,
	1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1,
	0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0,
	1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1,
	0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0,
	0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1, 0,
	1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1
};

__HIGH_CODE
void blink(int n) {
	for(int i = n-1; i >= 0; i--) {
#if ENABLE_PB8_STATUS_LED
		funDigitalWrite( LED, FUN_LOW ); // Turn on LED
#endif
#if !SK6812_DISABLE
		switch( i % 3 )
		{
			case 0: sk6812_set_rgb(SK6812_BRIGHT, 0, 0); break;
			case 1: sk6812_set_rgb(0, SK6812_BRIGHT, 0); break;
			default: sk6812_set_rgb(0, 0, SK6812_BRIGHT); break;
		}
#endif
		Delay_Ms(33);
#if ENABLE_PB8_STATUS_LED
		funDigitalWrite( LED, FUN_HIGH ); // Turn off LED
#endif
#if !SK6812_DISABLE
		sk6812_set_rgb(0, 0, 0);
#endif
		if(i) Delay_Ms(33);
	}
}

__INTERRUPT
void GPIOB_IRQHandler() {
#if ENABLE_BOOT_BUTTON
	int status = R16_PB_INT_IF;
	R16_PB_INT_IF = status; // acknowledge

	if(status & PB8) { // PB22 interrupt comes in on PB8 if RB_PIN_INTX is set
		USBFSReset();
		blink(2);
		jump_isprom();
	}
#endif
}

void GPIOSetup() {
#if ENABLE_PB8_STATUS_LED
	funPinMode( LED, GPIO_CFGLR_OUT_2Mhz_PP );
#endif
	funPinMode( STATUS_SK6812_PIN, GPIO_ModeOut_PP_20mA );
	GPIO_ResetBits( STATUS_SK6812_PIN );
	audio_init();
	sk6812_set_grbw(0, 0, 0, 0);

#if ENABLE_BOOT_BUTTON
	funPinMode( PB22, GPIO_CFGLR_IN_PU ); // Set PB22 to input, pullup as keypress is to gnd

	R16_PIN_ALTERNATE |= RB_PIN_INTX; // set PB8 interrupt to PB22
	R16_PB_INT_MODE |= (PB8 & ~PB); // edge mode, should go to ch32fun.h
	funDigitalWrite(PB22, FUN_LOW); // falling edge

