wrickert/UntitledElectronics/Badges/BsidesDSM26/Code/ch585_grand_finale/ch585_grand_finale.c
	NVIC_EnableIRQ(GPIOB_IRQn);
	R16_PB_INT_IF = (PB8 & ~PB); // reset PB8/PB22 flag
	R16_PB_INT_EN |= (PB8 & ~PB); // enable PB8/PB22 interrupt

	SYS_SAFE_ACCESS(
		R8_SLP_WAKE_CTRL |= (RB_WAKE_EV_MODE | RB_SLP_GPIO_WAKE);
		R8_SLP_POWER_CTRL &= ~(RB_WAKE_DLY_MOD);
		R8_SLP_POWER_CTRL |= 0x00; // 0x00: long delay, 0x01: short delay (short doesn't work here)
	);
#endif
}

int HandleSetupCustom( struct _USBState * ctx, int setup_code) {
	return 0;
}

int HandleInRequest( struct _USBState * ctx, int endp, uint8_t * data, int len ) {
	(void)ctx;
	(void)len;

	// For USBFS we "prime" IN packets via USBFS_SendEndpointNEW() (see usb_tx_pump()).
	// Leaving this handler empty keeps the endpoint NAK'd unless we explicitly queue data.
	(void)endp;
	(void)data;
	return 0;
}

__HIGH_CODE
void HandleDataOut( struct _USBState * ctx, int endp, uint8_t * data, int len ) {
	(void)ctx;

	if (endp != USB_EP_RX) return;

	// Protocol over USBFS bulk OUT:
	// [uint16_le payload_len][payload bytes...]
	//
	// We must assemble because USBFS max packet size is 64 bytes.
	int i = 0;
	while (i < len) {
		if (g_usb_rx_len_bytes < 2) {
			if (g_usb_rx_len_bytes == 0) g_usb_rx_len_tmp0 = data[i++];
			else g_usb_rx_len_tmp1 = data[i++];
			g_usb_rx_len_bytes++;

			if (g_usb_rx_len_bytes == 2) {
				g_usb_rx_expected = (uint16_t)g_usb_rx_len_tmp0 | ((uint16_t)g_usb_rx_len_tmp1 << 8);

				// Refuse oversized messages; reset assembly to re-sync.
				if (g_usb_rx_expected > USB_APP_MAX_PAYLOAD) {
					usb_rx_reset_assembly();
					((uint16_t*)gs_usb_data_buf)[0] = 0;
					return;
				}
			}
			continue;
		}

		// If an application packet is already waiting to be consumed, drop new data to avoid corruption.
		if (((uint16_t*)gs_usb_data_buf)[0]) {
			usb_rx_reset_assembly();
			return;
		}

		uint16_t remaining = g_usb_rx_expected - g_usb_rx_received;
		uint16_t take = (uint16_t)(len - i);
		if (take > remaining) take = remaining;

		memcpy((void*)&gs_usb_data_buf[2 + g_usb_rx_received], &data[i], take);
		i += take;
		g_usb_rx_received += take;

		if (g_usb_rx_received >= g_usb_rx_expected) {
			// Message complete. Publish length for main loop.
			((uint16_t*)gs_usb_data_buf)[0] = g_usb_rx_expected;

			// Preserve old reboot-to-bootloader magic (payload 0x010001a2).
			if (g_usb_rx_expected == 4 && ((uint32_t*)&gs_usb_data_buf[2])[0] == 0x010001a2) {
				USBFSReset();
				blink(2);
				jump_isprom();
			}

			usb_rx_reset_assembly();
			return;
		}
	}
}

	__INTERRUPT
	__HIGH_CODE
	void NFC_IRQHandler(void) {
		// Read the interrupt status and write it back to clear the flags.
		uint16_t intf_status = R16_NFC_INTF_STATUS;
		R16_NFC_INTF_STATUS = intf_status;

		// --- State 1: TRANSMITTING ---
		if (g_nfca_pcd_comm_status == 1) {
		// Check if the TX FIFO is ready for more data (TX FIFO Empty flag)
		if ((intf_status & 8) && (g_nfca_pcd_send_fifo_bytes < g_nfca_pcd_send_total_bytes)) {
			// Refill the FIFO with up to 5 words
			for (int i = 0; i < 5; i++) {
				R16_NFC_FIFO = gs_nfca_data_buf[g_nfca_pcd_send_fifo_bytes++];
				if (g_nfca_pcd_send_fifo_bytes >= g_nfca_pcd_send_total_bytes) {
					break;
				}
			}
		}

			// Check if the transmission has completed (TX Complete flag)
			if (intf_status & 1) {

				// If mode is Transceive, switch to receive mode
				R8_NFC_CMD &= ~(0x01); // Clear the Start TX bit
				if (g_nfca_pcd_intf_mode) {
					g_nfca_pcd_recv_bits = 0;
					g_nfca_pcd_recv_word_idx = 0;

					// Set RX control register (optionally disables HW CRC checking for
					// ISO14443A short responses like ATQA).
					R8_NFC_STATUS = g_nfca_pcd_rx_status_reg;

					g_nfca_pcd_comm_status = 2; // Change state to Receiving
					R8_NFC_CMD |= 0x18; // Enable RX

					// Some CH58x NFC implementations appear to latch RX complete/error flags
					// in the same interrupt as TX complete. If so, consume them immediately
					// to avoid getting stuck in comm_status==2 until the software timeout.
					if (intf_status & 2) {
						nfca_rx_finalize_from_hw();
						g_nfca_pcd_comm_status = 5; // Status: Success
					}
					else if (intf_status & 0x10) {
						nfca_rx_finalize_from_hw();
						g_nfca_pcd_comm_status = 3; // Status: Parity Error
					}
					else if (intf_status & 0x20) {
						g_nfca_pcd_crcerr_seen = 1;
						nfca_rx_finalize_from_hw();
						g_nfca_pcd_comm_status = g_nfca_pcd_crcerr_is_fatal ? 4 : 5;
					}
				} 
				// If mode is Transmit-only, the operation is complete
				else {
					R8_NFC_STATUS = 0;
					g_nfca_pcd_comm_status = 5; // Status: Success
				}
			}
		}
		// --- State 2: RECEIVING ---
		else if (g_nfca_pcd_comm_status == 2) {
			// Check if there is data in the RX FIFO (FIFO Not Empty flag)
			if (intf_status & 4) { // Note: OV flag is used for Not Empty
				// Drain up to 5 words from the FIFO
				for (int i = 0; i < 5; i++) {
					gs_nfca_data_buf[g_nfca_pcd_recv_word_idx++] = R16_NFC_FIFO;
			}
		}

			// Check if the reception has completed (RX Complete flag)
			if (intf_status & 2) {
				nfca_rx_finalize_from_hw();
				g_nfca_pcd_comm_status = 5; // Status: Success
			}
			// Check for error flags
			else if (intf_status & 0x10) {
				nfca_rx_finalize_from_hw();
				g_nfca_pcd_comm_status = 3; // Status: Parity Error
			}
			else if (intf_status & 0x20) {
				// CRCERR can be raised for frames without CRC_A (e.g. ATQA, anticollision).
				// Capture any received bits so the higher layer can still parse/parity-check.
				g_nfca_pcd_crcerr_seen = 1;
				nfca_rx_finalize_from_hw();

				g_nfca_pcd_comm_status = g_nfca_pcd_crcerr_is_fatal ? 4 : 5;
			}
		}
	// --- Any Other State: ERROR ---
	else {
		g_nfca_pcd_comm_status = 6; // Status: General Error
	}
}

uint16_t sys_get_vdd(void) {
	uint8_t  sensor, channel, config, tkey_cfg;
	uint16_t adc_data;

	tkey_cfg = R8_TKEY_CFG;
	sensor = R8_TEM_SENSOR;
	channel = R8_ADC_CHANNEL;
	config = R8_ADC_CFG;

	R8_TKEY_CFG &= ~RB_TKEY_PWR_ON;
	R8_ADC_CHANNEL = CH_INTE_VBAT;
	R8_ADC_CFG = RB_ADC_POWER_ON | RB_ADC_BUF_EN | (0 << 4);
	R8_ADC_CONVERT &= ~RB_ADC_PGA_GAIN2;
	R8_ADC_CONVERT |= (3 << 4);
	R8_ADC_CONVERT |= RB_ADC_START;
	{
		uint64_t deadline = now_ticks() + Ticks_from_Ms(10);
		while (R8_ADC_CONVERT & RB_ADC_START) {
			if ((int64_t)(now_ticks() - deadline) > 0) {
				adc_data = 0;
				goto out_restore;
			}
		}
	}
	adc_data = R16_ADC_DATA;

out_restore:
	R8_TEM_SENSOR = sensor;
	R8_ADC_CHANNEL = channel;
	R8_ADC_CFG = config;
	R8_TKEY_CFG = tkey_cfg;
	return (adc_data);
}

int ADC_VoltConverSignalPGA_MINUS_12dB(uint16_t adc_data) {
	return (((int)adc_data*1050+256)/512 - 3*1050);
}

void nfca_init() {
	// NFC CTR
	if (NFCA_ENABLE_CTR_PIN) {
		funPinMode(PA7, GPIO_CFGLR_OUT_2Mhz_PP);
		funDigitalWrite(PA7, FUN_HIGH);
	} else {
		funPinMode(PA7, GPIO_CFGLR_IN_FLOAT);
	}
	R32_PIN_IN_DIS |= PA7; // disable PA7 digital input

	funPinMode( (PB8 | PB9 | PB16 | PB17), GPIO_CFGLR_IN_FLOAT );
	R32_PIN_IN_DIS |= (((PB8 | PB9) & ~PB) << 16); // disable PB8 PB9 digital input
	R16_PIN_CONFIG |= (((PB16 | PB17) & ~PB) >> 8); // gpio alt func

	// Enable RF antenna switch outputs on PB16..PB21 (required on some boards for antenna driver routing).
	R16_PIN_ALTERNATE |= RB_RF_ANT_SW_EN;
}

// NFCA PCD functions
void nfca_pcd_start(void) {
	R8_NFC_CMD = 0x24;
	R32_NFC_DRV &= 0xe7ff;
	// Empirical analog-front-end preset: bits 5/9/10 are used by WCH examples in NFC paths.
	// This can materially affect RX sensitivity on some boards.
	R32_NFC_DRV |= 0x0620;
	NVIC_ClearPendingIRQ(NFC_IRQn);
	NVIC_EnableIRQ(NFC_IRQn);
}

