wrickert/UntitledElectronics/Badges/BsidesDSM26/Code/ch585_grand_finale/ch585_grand_finale.c
	return ((num_bits / 8) *9) + (num_bits % 8);
}

	uint8_t nfca_pcd_comm(uint16_t data_bits_num, NFCA_PCD_REC_MODE_Def mode, uint8_t offset) {
	// Check for a minimum number of bits.
	if (data_bits_num <= 3) {
		g_nfca_pcd_intf_mode = 0;
		g_nfca_pcd_comm_status = 6; // Status: Error/Invalid Param
		return 1;
	}

	// Prepare the raw data buffers into a single packed buffer for the FIFO.
	int prepared_byte_len = nfca_pcd_prepare_send_data(g_nfca_pcd_send_buf, data_bits_num, g_nfca_parity_buf, gs_nfca_data_buf, NFCA_DATA_BUF_SIZE);

	// --- Configure NFC Hardware ---
	R8_NFC_STATUS = 0; // Clear control register

	// Clear command bits 0 and 4 (CMD_IDLE and CMD_MF_AUTH)
	R8_NFC_CMD &= ~(0x11);

		// Store current communication parameters in global state
		g_nfca_pcd_intf_mode = mode;
		g_nfca_pcd_buf_offset = offset;
		g_nfca_pcd_crcerr_seen = 0;
		// Keep the original RX control settings; different CH58x variants
		// interpret these bits differently. We handle CRCERR in software.
		g_nfca_pcd_rx_status_reg = (g_nfca_pcd_intf_mode & 0x10) ? 0x36 : 0x26;

	// Set the total number of bytes to be transmitted
	R16_NFC_RXTX_LEN = (uint16_t)prepared_byte_len;

	// Calculate the number of 9-bit words to transmit.
	// The hardware appears to send data in 9-bit frames (8 data + 1 parity).
	int num_words = (prepared_byte_len + 8) / 9;

	// --- Load Data into FIFO ---
	if (prepared_byte_len > 72) {
		// For large transfers, load the first 8 words (16 bytes) into the FIFO.
		// The hardware might use DMA for the rest of the data.
		for (int i = 0; i < 8; i++) {
			R16_NFC_FIFO = gs_nfca_data_buf[i];
		}
		g_nfca_pcd_send_fifo_bytes = 8;
	}
	else {
		// For smaller transfers, load all the words into the FIFO.
		for (int i = 0; i < num_words; i++) {
			R16_NFC_FIFO = gs_nfca_data_buf[i];
		}
		g_nfca_pcd_send_fifo_bytes = num_words;
	}

	// --- Start Transmission ---
	g_nfca_pcd_send_total_bytes = num_words;
	g_nfca_pcd_comm_status = 1; // Status: Transmitting

	// Set registers to indicate 9-bit transmission format
	R16_NFC_INTF_STATUS = 9;
	R8_NFC_STATUS = 9;

	R8_NFC_CMD |= (mode ? 9 : 1);

	return 0; // Success
}

nfca_pcd_controller_state_t nfca_pcd_wait_comm_end(void) {
	nfca_pcd_controller_state_t status;
	uint32_t overtimes;

	overtimes = 0;

	while (1) {
		status = nfca_pcd_get_comm_status();
		if ((status != NFCA_PCD_CONTROLLER_STATE_FREE) || (overtimes > (NFCA_PCD_WAIT_MAX_MS * 10))) {
			break;
		}

		Delay_Us(100);
		overtimes++;
	}

	return status;
}

uint16_t nfca_pcd_lpcd_adc_filter_buf_add(uint16_t lpcd_adc) {
	uint32_t lpcd_adc_all = 0;
	for(uint8_t i = 0; i < 7; i++) {
		gs_lpcd_adc_filter_buf[i] = gs_lpcd_adc_filter_buf[i + 1];
		lpcd_adc_all = lpcd_adc_all + gs_lpcd_adc_filter_buf[i];
	}
	gs_lpcd_adc_filter_buf[7] = lpcd_adc;
	lpcd_adc_all = lpcd_adc_all + gs_lpcd_adc_filter_buf[7];
	lpcd_adc_all = (lpcd_adc_all >> 3);
	return (uint16_t)lpcd_adc_all;
}

__HIGH_CODE
uint8_t nfca_pcd_lpcd_check(void) {
	uint32_t adc_value_diff;
	uint16_t adc_value;
	uint8_t res = 0;

	adc_value = nfca_adc_get_ant_signal();
	if(adc_value > gs_lpcd_adc_base_value) {
		adc_value_diff = adc_value - gs_lpcd_adc_base_value;
	}
	else {
		adc_value_diff = gs_lpcd_adc_base_value - adc_value;
	}
	adc_value_diff = (adc_value_diff * 1000) / gs_lpcd_adc_base_value;

	if((adc_value > gs_lpcd_adc_base_value) && (adc_value_diff > NFCA_PCD_LPCD_THRESHOLD_MAX_LIMIT_PERMIL)) {
		adc_value = ((uint32_t)gs_lpcd_adc_base_value * (1000 + NFCA_PCD_LPCD_THRESHOLD_MAX_LIMIT_PERMIL) / 1000);
	}
	else {
		if(adc_value_diff >= NFCA_PCD_LPCD_THRESHOLD_PERMIL) {
			res = 1;
		}

		if(adc_value < gs_lpcd_adc_base_value) {
			adc_value = gs_lpcd_adc_base_value - 1;
		}
	}

	gs_lpcd_adc_base_value = nfca_pcd_lpcd_adc_filter_buf_add(adc_value);
	return res;
}

// ISO 14443-3A functions
__HIGH_CODE
uint16_t ISO14443_CRCA(uint8_t *buf, int len) {
	uint8_t *data = buf;
	uint16_t crc = 0x6363;
	uint8_t ch;
	while (len--) {
		ch = *data++ ^ crc;
		ch = ch ^ (ch << 4);
		crc = (crc >> 8) ^ (ch << 8) ^ (ch << 3) ^ (ch >> 4);
	}
	return crc;
}

__HIGH_CODE
uint16_t ISO14443AAppendCRCA(void *buf, uint16_t len) {
	uint16_t crc = 0x6363;
	uint8_t *data = (uint8_t *) buf;
	uint8_t byte8 = 0;

	while (len--) {
		byte8 = *data++;
		byte8 ^= crc & 0xFF;
		byte8 ^= byte8 << 4;

		crc = ((((uint16_t)byte8 << 8) | (((crc) >> 8) & 0xFF))
				^ (uint8_t)(byte8 >> 4)
				^ ((uint16_t)byte8 << 3));
	}

	data[0] = (crc >> 0) & 0x00FF;
	data[1] = (crc >> 8) & 0x00FF;

	return crc;
}

__HIGH_CODE
uint8_t ISO14443ACheckOddParityBit(uint8_t *data, uint8_t *parity, uint16_t len) {
	for (int i = 0; i < len; i++) {
		if ((byteParityBitsTable[data[i]]) != parity[i]) {
			return 0;
		}
	}
	return 1;
}

__HIGH_CODE
void ISO14443ACalOddParityBit(uint8_t *data, uint8_t *out_parity, uint16_t len) {
	for (int i = 0; i < len; i++) {
		out_parity[i] = byteParityBitsTable[data[i]];
	}
}

// PCD functions
__HIGH_CODE
	int PcdReq(int cmd, uint8_t *data, int len) {
		uint16_t res = PCD_COMMUNICATE_ERROR;
		int comm_len = 0;

	if(cmd != CMD_RBLOCK) {
		// clear chaining buffers
		for(int i = 0; i < NFCA_PCD_CHAINING_BUFFERS; i++) {
			g_nfca_pcd_recv_buf_chain[i * sizeof(g_nfca_pcd_recv_buf)] = 0;
		}
	}

			switch(cmd) {
	case CMD_REQA:
	case CMD_WUPA:
		g_nfca_pcd_send_buf[0] = cmd;
		nfca_pcd_wait_us(200);
		comm_len = 7;
		break;
	case CMD_HALT:
		g_nfca_pcd_send_buf[0] = CMD_HALT;
		g_nfca_pcd_send_buf[1] = 0;
		len = 2;
		comm_len = (len +2) * 8;

		ISO14443AAppendCRCA(g_nfca_pcd_send_buf, len);
		ISO14443ACalOddParityBit(g_nfca_pcd_send_buf, g_nfca_parity_buf, len +2);	
		nfca_pcd_wait_ms(5);
		break;
	case CMD_ANTICOLL1:
	case CMD_ANTICOLL2:
	case CMD_ANTICOLL3:
		if(len == 2) {
			g_nfca_pcd_send_buf[0] = cmd;
			g_nfca_pcd_send_buf[1] = 0x20;
			comm_len = len *8;

			ISO14443ACalOddParityBit(g_nfca_pcd_send_buf, g_nfca_parity_buf, len);
			nfca_pcd_wait_ms(PCD_ANTICOLL_OVER_TIME);
		}
		else {
			g_nfca_pcd_send_buf[0] = cmd;
			g_nfca_pcd_send_buf[1] = 0x70;
			g_nfca_pcd_send_buf[6] = 0;
			for(int i = 0; i < 4; i++) {
				g_nfca_pcd_send_buf[i + 2] = data[i];
				g_nfca_pcd_send_buf[6] ^= data[i];
			}
			len = 7;
			comm_len = (len +2) * 8;

			ISO14443AAppendCRCA(g_nfca_pcd_send_buf, len);
			ISO14443ACalOddParityBit(g_nfca_pcd_send_buf, g_nfca_parity_buf, len +2);
			nfca_pcd_wait_ms(PCD_SELECT_OVER_TIME);
		}
		break;
	case CMD_RATS:
		g_nfca_pcd_send_buf[0] = CMD_RATS;
		g_nfca_pcd_send_buf[1] = 0x80; // FSDI, max frame size 256
		len = 2;
		comm_len = (len +2) * 8;
		apdu_iblock_number = 0x02; // we'll start with apdu's in i-blocks after this

		ISO14443AAppendCRCA(g_nfca_pcd_send_buf, len);
		ISO14443ACalOddParityBit(g_nfca_pcd_send_buf, g_nfca_parity_buf, len +2);
		nfca_pcd_wait_ms(PCD_APDU_OVER_TIME);
		break;
	case CMD_IBLOCK:
		g_nfca_pcd_send_buf[0] = apdu_iblock_number;
		apdu_iblock_number ^= 1;
		for(int i = 0; i < len; i++) {
			g_nfca_pcd_send_buf[i +1] = data[i];
		}
		len++;
		comm_len = (len +2) * 8;

		ISO14443AAppendCRCA(g_nfca_pcd_send_buf, len);
		ISO14443ACalOddParityBit(g_nfca_pcd_send_buf, g_nfca_parity_buf, len +2);
		nfca_pcd_wait_ms(PCD_APDU_OVER_TIME);
		break;
	case CMD_WTX:
		g_nfca_pcd_send_buf[0] = data[0];
		g_nfca_pcd_send_buf[1] = data[1];
		len = 2;
		comm_len = (len +2) * 8;

		ISO14443AAppendCRCA(g_nfca_pcd_send_buf, len);
		ISO14443ACalOddParityBit(g_nfca_pcd_send_buf, g_nfca_parity_buf, len +2);
		break;
		case CMD_RBLOCK:
			g_nfca_pcd_send_buf[0] = cmd + apdu_iblock_number;
			apdu_iblock_number ^= 1;
			len = 1;
			comm_len = (len +2) * 8;

			ISO14443AAppendCRCA(g_nfca_pcd_send_buf, len);
			ISO14443ACalOddParityBit(g_nfca_pcd_send_buf, g_nfca_parity_buf, len +2);
			break;
		case CMD_T2T_READ:
			// Type 2 Tag / Ultralight / NTAG READ (0x30) does not require anticollision if only one tag is present.
			// TX: 0x30, page (1 byte), CRC_A
			// RX: 16 data bytes + CRC_A
			g_nfca_pcd_send_buf[0] = CMD_T2T_READ;
			g_nfca_pcd_send_buf[1] = (data && len >= 1) ? data[0] : 0;
			len = 2;
			comm_len = (len + 2) * 8;
			ISO14443AAppendCRCA(g_nfca_pcd_send_buf, len);
			ISO14443ACalOddParityBit(g_nfca_pcd_send_buf, g_nfca_parity_buf, len + 2);
			nfca_pcd_wait_ms(PCD_APDU_OVER_TIME);
			break;
			}

		// Configure whether HW CRC checking is expected/desired for this exchange.
		// ATQA and anticollision responses do not include CRC_A.
		g_nfca_pcd_rx_crc_enable = 1;
		g_nfca_pcd_crcerr_is_fatal = 1;
		if ((cmd == CMD_REQA) || (cmd == CMD_WUPA)) {
			g_nfca_pcd_rx_crc_enable = 0;
			g_nfca_pcd_crcerr_is_fatal = 0;
		}
		else if (((cmd == CMD_ANTICOLL1) || (cmd == CMD_ANTICOLL2) || (cmd == CMD_ANTICOLL3)) && (g_nfca_pcd_send_buf[1] == 0x20)) {
			g_nfca_pcd_rx_crc_enable = 0;
			g_nfca_pcd_crcerr_is_fatal = 0;
		}

