wrickert/UntitledElectronics/Badges/BsidesDSM26/Code/ch585_grand_finale/ch585_grand_finale.c
		if (nfca_pcd_comm(comm_len, NFCA_PCD_REC_MODE_NORMAL, 0) == 0) {
			if(nfca_pcd_wait_comm_end() == NFCA_PCD_CONTROLLER_STATE_DONE) {
				if (g_nfca_pcd_recv_bits % 9 == 0) {
					int nbytes = g_nfca_pcd_recv_bits /9;
					if (ISO14443ACheckOddParityBit(g_nfca_pcd_recv_buf, g_nfca_parity_buf, nbytes)) {
						if ((cmd == CMD_REQA) || (cmd == CMD_WUPA)) {
							// ATQA is exactly 2 bytes (no CRC_A). Guard against treating
							// empty/partial frames as a successful poll.
							res = (nbytes >= 2) ? PCD_NO_ERROR : PCD_FRAME_ERROR;
						}
						else if (((cmd == CMD_ANTICOLL1) || (cmd == CMD_ANTICOLL2) || (cmd == CMD_ANTICOLL3)) && g_nfca_pcd_send_buf[1] == 0x20) {
							// Anticollision response is 5 bytes (UID[4] + BCC), no CRC_A.
							if (nbytes < 5) {
								res = PCD_FRAME_ERROR;
							}
							else if (ISO14443A_CHECK_BCC(g_nfca_pcd_recv_buf)) {
								res = PCD_NO_ERROR;
							}
							else {
								res = PCD_BCC_ERROR;
							}
						}
						else if (ISO14443_CRCA(g_nfca_pcd_recv_buf, nbytes) == 0) {
							res = PCD_NO_ERROR;
						}
					else {
						res = PCD_CRC_ERROR;
					}
				}
				else {
					res = PCD_ODD_PARITY_ERROR;
				}
			}
			else {
				// recv_bits not multiple of 9
				res = PCD_FRAME_ERROR;
			}
		}
	}

	// handle sblocks and rblocks
	if(res == PCD_NO_ERROR) {
		if(g_nfca_pcd_recv_buf[0] == CMD_WTX) {
			res = PcdReq(CMD_WTX, g_nfca_pcd_recv_buf, 2);
		}
		else if ((g_nfca_pcd_recv_buf[0] & 0x10) && ((cmd == CMD_IBLOCK) || (cmd == CMD_RBLOCK))) {
			// Chaining bit is set, copy receive buffer to available chain buffer
			for(int i = 0; i < NFCA_PCD_CHAINING_BUFFERS; i++) {
				if(g_nfca_pcd_recv_buf_chain[i * sizeof(g_nfca_pcd_recv_buf)] == 0) {
					for(int j = 0; j < sizeof(g_nfca_pcd_recv_buf); j++) {
						g_nfca_pcd_recv_buf_chain[(i * sizeof(g_nfca_pcd_recv_buf)) +j] = g_nfca_pcd_recv_buf[j];
					}
					break;
				}
			}
			res = PcdReq(CMD_RBLOCK, 0, 0); // we are ready, request the next part of the chained frame
		}
	}

	return res;
}


// main process loop functions

__HIGH_CODE
void process_usb_packet(void) {
	// Check if we have received a packet in the global buffer
	if( ((uint16_t*)gs_usb_data_buf)[0]  ) {
		// Handle specific commands here if needed (e.g. configuration)
		//

		// If we receive data but we aren't in card_interaction,
		// it might be a mistake or a re-sync. Clear the buffer.
		((uint16_t*)gs_usb_data_buf)[0] = 0;
	}
}

__HIGH_CODE
	void send_heartbeat_if_free(void) {
		const char *version = "nfca585 v1";
		// Only send if no message is currently queued.
		if (!g_usb_tx_len) {
			usb_tx_queue_message((const uint8_t*)version, (uint16_t)strlen(version));
		}
		usb_tx_pump();
	}

	__HIGH_CODE
	void card_interaction(int uid_len, int atqa, int sak) {
	int iso14443_4 = ((sak & 0x20) != 0);
	int iso14443_3_devtest_jcop = (sak == 0x00 && gs_picc_uid[0] == 0x00);
	int iso14443_3_type2 = (sak == 0x00 && gs_picc_uid[0] != 0x00);
	uint64_t timeout = 0;

	if (iso14443_3_type2) {
		ntag_dump_read_only(uid_len);
		return;
	}

	if(iso14443_4 || iso14443_3_devtest_jcop) {
		if(PcdReq(CMD_RATS, 0, 0) == PCD_NO_ERROR) {
			// Send RATS response to PC
			while (g_usb_tx_len) { }
			usb_tx_queue_message((const uint8_t*)g_nfca_pcd_recv_buf, (uint16_t)(g_nfca_pcd_recv_bits / 9));

				// Set a timeout for the PC to reply
				timeout = now_ticks() + Ticks_from_Ms(PCD_APDU_OVER_TIME);

				// While waiting for PC response, we block here because timing is strict
				// for the NFC field. Losing the field usually kills the card state.
				while( (int64_t)(now_ticks() - timeout) < 0 ) {
					usb_tx_pump();
					if( *(volatile uint16_t*)gs_usb_data_buf ) {
						// we got a new APDU to send from PC
						if( PcdReq(CMD_IBLOCK, (uint8_t *)&gs_usb_data_buf[2], ((uint16_t*)gs_usb_data_buf)[0]) == PCD_NO_ERROR ) {
						// Send chained responses
						for(int i = 0; i < NFCA_PCD_CHAINING_BUFFERS; i++) {
								if(g_nfca_pcd_recv_buf_chain[i * sizeof(g_nfca_pcd_recv_buf)]) {
									while (g_usb_tx_len) { }
									usb_tx_queue_message((const uint8_t*)&g_nfca_pcd_recv_buf_chain[i * sizeof(g_nfca_pcd_recv_buf)], (uint16_t)sizeof(g_nfca_pcd_recv_buf));
									g_nfca_pcd_recv_buf_chain[i * sizeof(g_nfca_pcd_recv_buf)] = 0;
								}
							else {
								break;
							}
							}
							// Send final response
							while (g_usb_tx_len) { }
							usb_tx_queue_message((const uint8_t*)g_nfca_pcd_recv_buf, (uint16_t)(g_nfca_pcd_recv_bits / 9));

							// Reset timeout for next command
							timeout = now_ticks() + Ticks_from_Ms(PCD_APDU_OVER_TIME);
						}

						// Ack processing of buffer
						((uint16_t*)gs_usb_data_buf)[0] = 0;
				}
			}
		}
	}
}

__HIGH_CODE
void main_task_loop() {
	int res = PCD_COMMUNICATE_ERROR;
	int atqa, sak;
	int uuid_len = 0;
	uint64_t next_scan_time = 0;
	uint64_t next_heartbeat_time = 0;
	uint8_t saw_card_response = 0;
	uint8_t played_full_feedback = 0;

	// Start heartbeats immediately; don't let ADC bring-up block USB.
	next_heartbeat_time = now_ticks();

	// Check VDD once at start or periodically if needed (best-effort).
	{
		uint16_t vdd_raw = sys_get_vdd();
		int vdd_value = ADC_VoltConverSignalPGA_MINUS_12dB(vdd_raw);
		if (NFCA_FORCE_MAX_DRIVE) {
			NFCA_PCD_SET_OUT_DRV(NFCA_PCD_DRV_CTRL_LEVEL3);
		} else {
			if(vdd_raw == 0) {
				// If ADC failed, choose a conservative drive level.
				NFCA_PCD_SET_OUT_DRV(NFCA_PCD_DRV_CTRL_LEVEL2);
			}
			else if(vdd_value > 3400)      NFCA_PCD_SET_OUT_DRV(NFCA_PCD_DRV_CTRL_LEVEL0);
			else if(vdd_value > 3000) NFCA_PCD_SET_OUT_DRV(NFCA_PCD_DRV_CTRL_LEVEL1);
			else if(vdd_value > 2600) NFCA_PCD_SET_OUT_DRV(NFCA_PCD_DRV_CTRL_LEVEL2);
			else                      NFCA_PCD_SET_OUT_DRV(NFCA_PCD_DRV_CTRL_LEVEL3);
		}
	}

	while(1) {
		// 1. Always process USB input (e.g. Reboot commands) immediately
		process_usb_packet();
		usb_tx_pump();

		// 2. Handle heartbeat (non-blocking)
		if ( (int64_t)(now_ticks() - next_heartbeat_time) > 0 ) {
			send_heartbeat_if_free();
			next_heartbeat_time = now_ticks() + Ticks_from_Ms(1000);
		}

		// 3. Handle NFC Scan (Periodically)
		if ( (int64_t)(now_ticks() - next_scan_time) > 0 ) {
			saw_card_response = 0;
			played_full_feedback = 0;

