wrickert/UntitledElectronics/Badges/BsidesDSM26/Code/ch585_grand_finale/ch585_grand_finale.c
			nfca_pcd_start();

			// LPCD Check (Fast). Optional bring-up bypass.
			if(NFCA_FORCE_ACTIVE_SCAN || nfca_pcd_lpcd_check()) {

					// Found something!
					// Reset antenna field to wake card
					R8_NFC_CMD &= ~RB_NFC_ANTENNA_ON;
					Delay_Ms(5);
					R8_NFC_CMD |= RB_NFC_ANTENNA_ON;
					Delay_Ms(NFCA_FIELD_SETTLE_MS);

				// --- ANTICOLLISION SEQUENCE ---
				// Try a few quick polls; weak antennas often only get a response on a subset of attempts.
				uint16_t reqa_res = PCD_COMMUNICATE_ERROR;
				for (int attempt = 0; attempt < NFCA_REQA_RETRIES; attempt++) {
					// Prefer WUPA: it also wakes tags in HALT state (common after a previous HLTA).
					uint16_t r = (uint16_t)PcdReq(CMD_WUPA, 0, 0);
					if (r != PCD_NO_ERROR) {
						r = (uint16_t)PcdReq(CMD_REQA, 0, 0);
					}
					reqa_res = r;
					if (r == PCD_NO_ERROR && g_nfca_pcd_recv_bits >= (2 * 9)) break;
					Delay_Us(200);
				}

				if(reqa_res == PCD_NO_ERROR) {
						saw_card_response = 1;
						atqa = ((uint16_t *)(g_nfca_pcd_recv_buf))[0];
						// Go straight to anticollision; sending HLTA here is unnecessary and can reduce reliability.
						Delay_Us(350);
						res = PcdReq(CMD_ANTICOLL1, /*0x20*/0, 2);
						int used_t2t_fallback = 0;

						// Fallback for weak Type 2 / NTAG tags: after REQA/WUPA, a single tag can accept a READ(0)
						// even without completing anticollision. This is a shorter exchange and can succeed when
						// anticollision/select is too marginal.
						if (res != PCD_NO_ERROR) {
							uint8_t page0 = 0;
							if (PcdReq(CMD_T2T_READ, &page0, 1) == PCD_NO_ERROR) {
								int nbytes = (int)(g_nfca_pcd_recv_bits / 9);
								if (nbytes >= 18) { // 16 data bytes + CRC_A (2)
									uint8_t *d = g_nfca_pcd_recv_buf; // includes CRC_A at the end
									uint8_t bcc0 = d[3];
									uint8_t bcc1 = d[8];
									uint8_t calc_bcc0 = (uint8_t)(0x88u ^ d[0] ^ d[1] ^ d[2]);
									uint8_t calc_bcc1 = (uint8_t)(d[4] ^ d[5] ^ d[6] ^ d[7]);

									if (bcc0 == calc_bcc0 && bcc1 == calc_bcc1) {
										uuid_len = 7;
										gs_picc_uid[0] = d[0];
										gs_picc_uid[1] = d[1];
										gs_picc_uid[2] = d[2];
										gs_picc_uid[3] = d[4];
										gs_picc_uid[4] = d[5];
										gs_picc_uid[5] = d[6];
										gs_picc_uid[6] = d[7];
										sak = 0x00; // Type 2 tags typically report SAK 0x00
										used_t2t_fallback = 1;
									}
								}
							}
						}

						if (!used_t2t_fallback && res == PCD_NO_ERROR) {
							if(g_nfca_pcd_recv_buf[0] == 0x88) {
								gs_picc_uid[0] = g_nfca_pcd_recv_buf[1];
								gs_picc_uid[1] = g_nfca_pcd_recv_buf[2];
								gs_picc_uid[2] = g_nfca_pcd_recv_buf[3];

							res = PcdReq(CMD_ANTICOLL1, g_nfca_pcd_recv_buf, 7);
							if (res == PCD_NO_ERROR) {
								res = PcdReq(CMD_ANTICOLL2, /*0x20*/0, 2);
								if (res == PCD_NO_ERROR) {
									if(g_nfca_pcd_recv_buf[0] == 0x88) {
										gs_picc_uid[3] = g_nfca_pcd_recv_buf[1];
										gs_picc_uid[4] = g_nfca_pcd_recv_buf[2];
										gs_picc_uid[5] = g_nfca_pcd_recv_buf[3];

										res = PcdReq(CMD_ANTICOLL2, g_nfca_pcd_recv_buf, 7);
										if (res == PCD_NO_ERROR) {
											res = PcdReq(CMD_ANTICOLL3, /*0x20*/0, 2);
											if (res == PCD_NO_ERROR) {
												uuid_len = 10;
												gs_picc_uid[6] = g_nfca_pcd_recv_buf[0];
												gs_picc_uid[7] = g_nfca_pcd_recv_buf[1];
												gs_picc_uid[8] = g_nfca_pcd_recv_buf[2];
												gs_picc_uid[9] = g_nfca_pcd_recv_buf[3];

												res = PcdReq(CMD_ANTICOLL3, g_nfca_pcd_recv_buf, 7);
												if (res == PCD_NO_ERROR) {
													sak = g_nfca_pcd_recv_buf[0];
												}
											}
											else {
												// anticoll3 error
											}
										}
										else {
											// uid1 error
										}
									}
									else {
										// 7 byte uid
										uuid_len = 7;
										gs_picc_uid[3] = g_nfca_pcd_recv_buf[0];
										gs_picc_uid[4] = g_nfca_pcd_recv_buf[1];
										gs_picc_uid[5] = g_nfca_pcd_recv_buf[2];
										gs_picc_uid[6] = g_nfca_pcd_recv_buf[3];

										res = PcdReq(CMD_ANTICOLL2, g_nfca_pcd_recv_buf, 7);
										if (res == PCD_NO_ERROR) {
											sak = g_nfca_pcd_recv_buf[0];
										}
									}
								}
								else {
									// anticoll2 error
								}
							}
							else {
								// uid0 error
							}
						}
						else {
							// 4 byte uid
							uuid_len = 4;
							gs_picc_uid[0] = g_nfca_pcd_recv_buf[0];
							gs_picc_uid[1] = g_nfca_pcd_recv_buf[1];
							gs_picc_uid[2] = g_nfca_pcd_recv_buf[2];
							gs_picc_uid[3] = g_nfca_pcd_recv_buf[3];

							res = PcdReq(CMD_ANTICOLL1, g_nfca_pcd_recv_buf, 7);
							if (res == PCD_NO_ERROR) {
								sak = g_nfca_pcd_recv_buf[0];
							}
						}
					}
					else {
						// anticoll1 error
					}

						if(uuid_len) {
							// Report basic card info (UID/ATQA/SAK) for *any* ISO14443A tag.
							// Payload format:
							// 0: 0xA5 (event marker)
							// 1: uid_len
							// 2..: uid bytes
							// next 2: ATQA little-endian
							// last 1: SAK
							uint8_t info[1 + 1 + 10 + 2 + 1];
							uint8_t info_len = 0;
							info[info_len++] = 0xA5;
							info[info_len++] = (uint8_t)uuid_len;
							memcpy(&info[info_len], gs_picc_uid, uuid_len);
							info_len += (uint8_t)uuid_len;
							info[info_len++] = (uint8_t)(atqa & 0xff);
							info[info_len++] = (uint8_t)(atqa >> 8);
							info[info_len++] = (uint8_t)sak;
							while (g_usb_tx_len) { }
							usb_tx_queue_message(info, info_len);
							usb_tx_pump();

							// Card is fully selected, enter interaction mode
							// This function IS allowed to block because we are in a session
							card_interaction(uuid_len, atqa, sak);

							// Clean up the NFC side before we touch audio / SK6812.
							PcdReq(CMD_HALT, 0, 0);
							nfca_pcd_stop();
							tag_feedback((uint8_t)uuid_len, (uint16_t)atqa, (uint8_t)sak);
							played_full_feedback = 1;
							atqa = 0;
							sak = 0;
							uuid_len = 0;
							next_scan_time = now_ticks() + Ticks_from_Ms(333);
							continue;
						}
				}
			}

			// Turn off NFC to save power/reset state
			nfca_pcd_stop();
			if (saw_card_response && !played_full_feedback) {
				audio_play_detect_chirp();
			}

			// Schedule next scan for 333ms from NOW
			next_scan_time = now_ticks() + Ticks_from_Ms(333);
		}
	}
}

int main() {
	SystemInit();

	funGpioInitAll(); // no-op on ch5xx
	GPIOSetup();
	audio_play_boot_debug_beep();
	usb_rx_reset_assembly();
	USBFSSetup();

#if !SK6812_DISABLE
	sk6812_set_rgb(SK6812_BRIGHT, 0, 0);
#endif

	// Prove USB is alive even if later bring-up (ADC/NFC) hangs.
	usb_tx_queue_message((const uint8_t*)"nfca585 boot", (uint16_t)strlen("nfca585 boot"));
	usb_tx_pump();

	blink(5); // Indicates boot

#if !SK6812_DISABLE
	sk6812_set_rgb(0, SK6812_BRIGHT, 0);
#endif

	nfca_init();
	nfca_pcd_lpcd_calibration();

	main_task_loop(); // Never returns

	while(1);
}
